app/controllers/matches_controller.rb

  def show
    match = Match.find(params[:id])
---
SELECT  `matches`.* FROM `matches` WHERE `matches`.`id` = 1 LIMIT 1